# CreateMap Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCHybridImport..::..CreateMap Method
IFCHybridImport Class See Also
---
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public IDictionary<IFCGuidKey, ElementId> CreateMap(
	Document doc,
	IList<ElementId> elementIds
)
```

Visual Basic
---
```text
Public Function CreateMap ( _
	doc As Document, _
	elementIds As IList(Of ElementId) _
) As IDictionary(Of IFCGuidKey, ElementId)
```

Visual C++
---
```text
public:
IDictionary<IFCGuidKey^, ElementId^>^ CreateMap(
	Document^ doc,
	IList<ElementId^>^ elementIds
)
```

# ### Parameters
doc
    Type: Autodesk.Revit.DB..::..Document
elementIds
    Type: System.Collections.Generic..::..IList<(Of <(<'ElementId>)>)>
# See Also
IFCHybridImport Class
Autodesk.Revit.DB.IFC Namespace